# BuiltInFailures.UniqueElementFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..UniqueElementFailures Members
BuiltInFailures..::..UniqueElementFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..UniqueElementFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ProhibitUniqueElementDeletion | Internal setting '%1!s!' is required by Revit and has been deleted. |

# See Also
BuiltInFailures..::..UniqueElementFailures Class
Autodesk.Revit.DB Namespace